//5,let g = (parameter1 ,parameter2,.. )=>{ מה עושה הפונקציה}

//                ()=>{}

let f1 = () => { }
let f2 = () => {

}
let f3 = (x, y) => {

}
//כתוב פונקצית חץ המקבלת כפרמטר 3 מספרים ומחזירה את הממוצע שלהם
//הפעל את הפונקציה על המספרים 1,5,9 
//והדפס את התוצאה 

let avg = (n1, n2, n3) => {
    return (n1 + n2 + n3) / 3
}

let sol1 = avg(1, 5, 9)
console.log(sol1);

// כתוב פונקצית חץ   המקבלת כפרמטר מספר ומחזירה את המספר בריבוע 
//power 
// הפעל את הפונקציה על המספר 9 
//ןבדוק שהפונקציה עובדת 
let power1 = (x) => {
    return x * x
}

let power2 = (x) =>  x * x
let power3 = x => x*x 
let p1 = power1(5)
console.log(p1)//25 
